In [1]:
import pandas as pd
import scipy 
import numpy as np
from scipy import stats

In [2]:
TAT = pd.read_csv ('C:/Users/navee/OneDrive/Desktop/Data Science Assignments/Assignment 3 - Hypothesis Testing/LabTAT.csv')

In [3]:
TAT.head(10)

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60
5        179.45        197.00        181.51        161.12
6        191.37        166.36        214.21        154.02
7        166.81        169.60        183.43        163.25
8        158.81        175.36        191.60        152.79
9        165.88        198.68        208.43        161.98

In [4]:
TAT.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [5]:
# As the data contain 4 columns, will perform ANOVA test 
# Hypothesis Statement
#Ho - There is no difference in average TAT among the different laboratories
#H1 - There is difference in average TAT among the different laboratories

In [6]:
stats.f_oneway(TAT.iloc[:,0], TAT.iloc[:,1], TAT.iloc[:,2], TAT.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [7]:
# Since pvalue (2.11e-57) < alpha (0.05), we reject null hypothesis Ho and accept H1.
# Hence it conculded that there is difference in average TAT among the different laboratories at 5% significance level.